---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.WaterLoopData.WaterLoopType
source: html/39cb2ea0-55a7-b6c5-d8de-bea375d0c369.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopData.WaterLoopType Property

The type of water loop. Note this property change would reset other properties.

## Syntax (C#)
```csharp
public WaterLoopType WaterLoopType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration